In [1]:
import pandas as pd
import numpy as np
import random
import string

# Carregando e salvando arquivos

## Criando um data frame

In [2]:
# primeiro definimos a estrutura do dataframe
df = {'a':[1,2,7,3,4],
      'b':[6,5,3,2,'a'], 
      }
# depois precisamos definir a estrutura como um dataframe do pandas
df = pd.DataFrame(df)
# mostra o dataframe
df

   a  b
0  1  6
1  2  5
2  7  3
3  3  2
4  4  a

## Exemplo 2: diversos tipos de variáveis

In [3]:
df = {'código':[1,2,"1",4],
      'nome':['John','Paul','George','Ringo'], 
      'instrumento':['vocal','baixo','guitarra','bateria'],
      'nascimento':['1940-10-09','1942-06-18','1943-02-25','1940-07-07']
      }
df = pd.DataFrame(df)
df

  código    nome instrumento  nascimento
0      1    John       vocal  1940-10-09
1      2    Paul       baixo  1942-06-18
2      1  George    guitarra  1943-02-25
3      4   Ringo     bateria  1940-07-07

## Como obter informações sobre o dataframe

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   código       4 non-null      object
 1   nome         4 non-null      object
 2   instrumento  4 non-null      object
 3   nascimento   4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [5]:
df.dtypes

código         object
nome           object
instrumento    object
nascimento     object
dtype: object

## Transformando o tipo de variável de uma coluna específica do dataframe

In [6]:
df['nascimento'] = pd.to_datetime(df['nascimento'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   código       4 non-null      object
 1   nome         4 non-null      object
 2   instrumento  4 non-null      object
 3   nascimento   4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(3)
memory usage: 256.0+ bytes

# Dados faltantes em tabelas

In [7]:
df = pd.DataFrame({
      'a':[1,np.nan,7,3,np.nan],
      'b':[np.nan,5,np.nan,2,6], 
      'c':[1,4,8,9,3],
      'd':[0,7,21,100,3]
      })
df

     a    b  c    d
0  1.0  NaN  1    0
1  NaN  5.0  4    7
2  7.0  NaN  8   21
3  3.0  2.0  9  100
4  NaN  6.0  3    3

## Exemplo: operações com colunas numéricas de um dataframe - soma

In [8]:
#%%timeit
df['e'] = df['c'] + df['d']

df

     a    b  c    d    e
0  1.0  NaN  1    0    1
1  NaN  5.0  4    7   11
2  7.0  NaN  8   21   29
3  3.0  2.0  9  100  109
4  NaN  6.0  3    3    6

## Exemplo: operações com colunas numéricas de um dataframe - multiplicação

In [9]:
df['f'] = df['c'] * df['d']

df

     a    b  c    d    e    f
0  1.0  NaN  1    0    1    0
1  NaN  5.0  4    7   11   28
2  7.0  NaN  8   21   29  168
3  3.0  2.0  9  100  109  900
4  NaN  6.0  3    3    6    9

## Exemplo: operações com colunas numéricas de um dataframe - divisão

In [10]:
df['g'] = df['d'] / df['c']

df

     a    b  c    d    e    f          g
0  1.0  NaN  1    0    1    0   0.000000
1  NaN  5.0  4    7   11   28   1.750000
2  7.0  NaN  8   21   29  168   2.625000
3  3.0  2.0  9  100  109  900  11.111111
4  NaN  6.0  3    3    6    9   1.000000

## Exemplo: operações com colunas numéricas de um dataframe - divisão por zero

In [11]:
df['h'] = df['e'] / df['f']

df

     a    b  c    d    e    f          g         h
0  1.0  NaN  1    0    1    0   0.000000       inf
1  NaN  5.0  4    7   11   28   1.750000  0.392857
2  7.0  NaN  8   21   29  168   2.625000  0.172619
3  3.0  2.0  9  100  109  900  11.111111  0.121111
4  NaN  6.0  3    3    6    9   1.000000  0.666667

# Agora vamos aprender a como ler um arquivo em csv utilizando o pandas.

In [12]:
df = pd.read_csv('01_introducao_basica.csv',encoding='latin-1',delimiter=';',low_memory = True)
df

,campo_1,campo_2,campo_3,campo_4,campo_5,campo_6,campo_7,campo_8,campo_9,campo_10
0,1,4,65,30,100,86,27,34,22,98
1,2,17,81,89,25,55,30,11,8,32
2,3,46,57,73,85,60,44,11,87,59
3,4,11,52,12,65,86,62,50,92,11
4,5,15,78,76,6,20,89,54,88,47
...,...,...,...,...,...,...,...,...,...,...
495,496,54,42,55,100,58,91,88,98,49
496,497,80,90,4,32,40,32,42,48,57
497,498,44,27,42,79,14,17,66,65,94
498,499,14,93,69,75,41,77,61,6,17
499,500,37,8,77,86,27,64,37,86,16

# Using Pandas crosstab e groupby

## Exemplo 1

In [13]:
# This is the total number of groups to be created
NumberOfGroups = 50000
# Create a lot of groups (random strings of 4 letters)
Group1     = [''.join(random.choice(string.ascii_uppercase) 
                for _ in range(4)) for x in range(NumberOfGroups//10)]*10
Group2     = [''.join(random.choice(string.ascii_uppercase) 
                for _ in range(4)) for x in range(NumberOfGroups//2)]*2
FinalGroup = [''.join(random.choice(string.ascii_uppercase) 
                for _ in range(4)) for x in range(NumberOfGroups)]
# Make the numbers
NumbersForPercents = [np.random.randint(100, 999) for _ in range(NumberOfGroups)]
# Make the dataframe
df = pd.DataFrame({'Group1': Group1,
                   'Group2': Group2,
                   'FinalGroup': FinalGroup,
                   'Numbers': NumbersForPercents})
df.head()

  Group1 Group2 FinalGroup  Numbers
0   CXQO   KXKZ       HMDS      375
1   KTRK   UQQA       MYVQ      387
2   BGMT   GOTZ       PAQV      657
3   SOFP   ISKK       AOIN      499
4   QWMH   HSTZ       PJND      787

In [17]:
# Initial grouping (basically a sorted version of df)
PreGroupby_df = df.groupby(["Group1","Group2","FinalGroup"]).agg({'Numbers': 'sum'}).reset_index()
# Get the sum of values for the "final group", append "_Sum" to it's column name, and change it into a dataframe (.reset_index)
SumGroup_df = df.groupby(["Group1","Group2"]).agg({'Numbers': 'sum'}).add_suffix('Sum').reset_index()
# Merge the two dataframes
Percents_df = pd.merge(PreGroupby_df, SumGroup_df)
# Divide the two columns
Percents_df["PercentFinalGroup"] = Percents_df["Numbers"] / Percents_df["NumbersSum"] * 100
# Drop the extra _Sum column
Percents_df.drop(["NumbersSum"], inplace=True, axis=1)
#
Percents_df

      Group1 Group2 FinalGroup  Numbers  PercentFinalGroup
0       AABJ   DFKD       DTON      743          47.689345
1       AABJ   DFKD       DWVB      815          52.310655
2       AABJ   FAGC       OJYT      831          72.449869
3       AABJ   FAGC       VYXC      316          27.550131
4       AABJ   MMBI       AUJG      341          55.537459
...      ...    ...        ...      ...                ...
49995   ZZRC   DBCZ       OXST      979          62.555911
49996   ZZRC   DGIV       KEQW      565          36.616980
49997   ZZRC   DGIV       YOCY      978          63.383020
49998   ZZRC   PTYN       PPXC      362          27.975270
49999   ZZRC   PTYN       WMPH      932          72.024730

[50000 rows x 5 columns]

## Exemplo 2

In [18]:
df = pd.DataFrame({'state': ['CA', 'WA', 'CO', 'AZ'] * 3,
               'office_id': list(range(1, 7)) * 2,
               'sales': [np.random.randint(100000, 999999) for _ in range(12)]})
df.head()

  state  office_id   sales
0    CA          1  876564
1    WA          2  764273
2    CO          3  664182
3    AZ          4  634037
4    CA          5  347261

In [21]:
result1 = pd.crosstab(index=df['state'], 
                     columns=df['office_id'], 
                     values=df['sales'], 
                     aggfunc='sum', 
                     normalize='index').applymap('{:.2f}%'.format).reset_index()
result1

C:\Users\Osvaldo\AppData\Local\Temp\ipykernel_25852\2822787264.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  result1 = pd.crosstab(index=df['state'],

office_id state      1      2      3      4      5      6
0            AZ  0.00%  0.40%  0.00%  0.39%  0.00%  0.21%
1            CA  0.42%  0.00%  0.41%  0.00%  0.17%  0.00%
2            CO  0.10%  0.00%  0.42%  0.00%  0.48%  0.00%
3            WA  0.00%  0.41%  0.00%  0.36%  0.00%  0.23%

In [22]:
result2 = pd.crosstab(index=df['state'], 
                     columns=df['office_id'], 
                     values=df['sales'], 
                     aggfunc='sum'
                    ).reset_index()
result2

office_id state         1         2         3         4         5         6
0            AZ       NaN  646023.0       NaN  634037.0       NaN  340177.0
1            CA  876564.0       NaN  854120.0       NaN  347261.0       NaN
2            CO  158352.0       NaN  664182.0       NaN  754943.0       NaN
3            WA       NaN  764273.0       NaN  679743.0       NaN  423880.0

In [23]:
df = pd.DataFrame([
        [123, 'abc'],
        [123, 'abc'],
        [456, 'def'],
        [123, 'abc'],
        [123, 'abc'],
        [456, 'def'],
        [456, 'def'],
        [456, 'def'],
        [333,'def'],
        [333,'abc'],
        [333,'def'],
        [333,'def'],
    ], columns=['userid', 'name'])
df

    userid name
0      123  abc
1      123  abc
2      456  def
3      123  abc
4      123  abc
5      456  def
6      456  def
7      456  def
8      333  def
9      333  abc
10     333  def
11     333  def

In [24]:
df.sort_values('userid').groupby('userid')['name'].apply(lambda df: df.reset_index(drop=True)).unstack()

          0    1    2    3
userid
123     abc  abc  abc  abc
333     def  abc  def  def
456     def  def  def  def

In [25]:
df_grouped = pd.crosstab(index = df['userid'], 
                       columns = df['name'], 
                       values = df['name'], 
                       aggfunc = 'count'
                      ).reset_index()
df_grouped = pd.DataFrame(df_grouped).fillna(0)
df_grouped

name  userid  abc  def
0        123  4.0  0.0
1        333  1.0  3.0
2        456  0.0  4.0

# Referências

* [Python for Data Analysis: Data Wrangling with Pandas, Numpy, and Ipython](https://www.amazon.com.br/Python-Data-Analysis-Wrangling-Ipython/dp/1449319793)
* [Learning pandas - Python Data Discovery and Analysis Made Easy](https://www.amazon.com.br/Learning-pandas-Discovery-Analysis-English-ebook/dp/B00W9Q7VPA/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&keywords=Learning+Pandas+%E2%80%93+Python+Data+Discovery+and+Analysis+Made+Easy&qid=1584127199&s=books&sr=1-1)
* [Learning the Pandas Library: Python Tools for Data Munging, Analysis, and Visualization](https://www.amazon.com.br/Learning-Pandas-Library-Analysis-Visualization-ebook/dp/B01GIE03GW/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&keywords=Learning+the+Pandas+Library&qid=1584127248&s=books&sr=1-1)
* [Create multiple dataframes in loop](https://stackoverflow.com/questions/30635145/create-multiple-dataframes-in-loop)
* [Create new data frame with the name from loop number](https://stackoverflow.com/questions/51896168/create-new-data-frame-with-the-name-from-loop-number/51897237)
* [Create new data frame with the name from loop number](https://stackoverflow.com/questions/51896168/create-new-data-frame-with-the-name-from-loop-number/51897237)
* [Pandas nested for loop insert multiple data on different data frames created](https://intellipaat.com/community/7420/pandas-nested-for-loop-insert-multiple-data-on-different-data-frames-created)
* https://stackoverflow.com/questions/22219004/grouping-rows-in-list-in-pandas-groupby/55839464#55839464
* https://stackoverflow.com/questions/38369424/groupby-transpose-and-append-in-pandas